hello/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @num = 10 + 1 #numはインスタンス変数
    @users = User.all #ユーザーテーブルのデータを取得して、インスタンス変数に入れておく