qanda/app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id]) #データを取り出す
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    # Questionモデルを初期化
    @question = Question.new(question_params)

    # Question.save
    @question.save
---
INSERT INTO "questions" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "わくわく"], ["title", "恋は成就するのか？"], ["content", "どうやったら、この恋がうまく行くのか分かりません。"], ["created_at", "2022-07-05 14:55:41.168199"], ["updated_at", "2022-07-05 14:55:41.168199"]]